// #### №41. ПРОГРАМ АЖИЛЛАХ БЭЛТГЭЛ АЖИЛ (ЭХЛЭЛ.) ####

//Тоглогчийн ээлжийг хадгалах хувьсагч. I pleyer 0, II player 1 гэж тэмдэглэе.
var activePlayer = 1;
// Тоглогчидийн цуглуулсан оноог хадгалах хувьсагч.
var scores = [0, 0];
// Тоглогч тоглож байх үеийн ээлжийн оноог хадгалах хувьсагч.
var roundScore = 0;
// Шооны аль талаараа буусны хадгалах хувьсагч хэрэгтэй. 1-6 гэсэн утгыг энэ хувьсагчид санамсаргүй үүсгэж өгнө.
var dice = Math.floor(Math.random() * 6) + 1;

document.querySelector("#score-0").textContent = 0; //document.querySelector - р HTML дээр бичигдсэн class-ыг # тэмдэглэгээ ашиглан дуудлаа.
document.querySelector("#score-1").textContent = 0;

document.querySelector("#current-0").textContent = 0;
document.querySelector("#current-1").textContent = 0;
//class-аар шооны зургийг хайх.
document.querySelector(".dice").style.display = "none";

console.log("Шоо " + dice);

// #### №41. ПРОГРАМ АЖИЛЛАХ БЭЛТГЭЛ АЖИЛ (ТӨГСГӨЛ.) ####

/* #### №42.  JAVASCRIPT-ЫН EVENT ГЭЖ ЮУ ВЭ? ЭВЕНТ НЬ БИДНИЙ ВЭБ ХУУДАС ДЭЭР БОЛЖ БАЙГАА ҮЙЛ ЯВЦ, ПРОЦЕСС ЮМ. 
    ЖИШЭЭЛБЭЛ:  ХЭРЭГЛЭГЧ MOUSE ДАРСАН УУ? SCROLL ДАРСАН УУ? ГЭХ МЭТ ПРОЦЕСС ЮМ. ЭВЕНТ - ҮЙЛ ЯВДАЛ ГЭСЭН АНГЛИ ҮГ.
    MESSAGE QUEUE НЬ ВЭБ ХУУДАС ДЭЭР ҮҮССЭН ЭВЕНТҮҮДИЙН БОЛОВСРУУЛАГДАХДАА ХҮЛЭЭГЭЭД ОЧЕРЛОЖ ЗОГСДОГ ГАЗАР НЬ ЮМ.
*/

/* ПРОГРАМЧЛАХ ДАРААЛАЛ
 1. Roll dice товчийг DOM-оос авна.
 2. Уг товч дээр хулганаар Click хийхэд ажиллах эвент листенер функц бичиж холбоно.
 3. click хийхэд 1-6 хооронд санамсаргүй тоо үүсгээд харгалзах шооны зургийг DOM-оос авна. Уг обьектийг вэб дээр харагддаг болгоно.
    Уг обьектийн зургийг  өөрчилнө.
 */
